#+title: Going from Python to Guile Scheme
#+author: Arne Babenhauserheide
#+options: toc:nil H:6 timestamp:nil

# Nice guide for styling a book: http://latex-my.blogspot.de/2010/01/front-and-back-covers.html

#+HTML_HEAD: <style type="text/css">.logo {text-align: center; width: 100%} .logo img {width: 38%; min-width: 24em}</style>

#+latex_class: memoir
#+latex_class_options: [a5paper]
# setup links. See http://en.wikibooks.org/wiki/LaTeX/Hyperlinks#Customization
#+latex_header: \usepackage{hyperref}
#+latex_header: \usepackage{pdfpages}
#+LATEX_HEADER: \usepackage{xcolor}
# FAKE ISBN for now.
#+LATEX_HEADER: \usepackage[ISBN=000-00-00000-00-0]{ean13isbn}
#+LATEX_HEADER: \DeclareUnicodeCharacter{A0}{\ }
#+LATEX_HEADER: \hypersetup{
#+LATEX_HEADER:     colorlinks,
#+LATEX_HEADER:     linkcolor={red!50!black},
#+LATEX_HEADER:     citecolor={blue!30!black},
#+LATEX_HEADER:     urlcolor={blue!50!black}
#+LATEX_HEADER: }
# extensive microtype from http://www.khirevich.com/latex/microtype/
#+latex_header: \usepackage[activate={true,nocompatibility},final,tracking=true,kerning=true,spacing=true,factor=1100,stretch=10,shrink=10,protrusion=true,expansion=true]{microtype}
#+latex_header: \usepackage{lmodern}
#+latex_header: \usepackage{wallpaper}
#+LaTeX_HEADER: \usepackage{rotating}
#+LaTeX_HEADER: \usepackage{csquotes}
#+LaTeX_HEADER: \usepackage[absolute,overlay]{textpos}
#+LaTeX_HEADER: \makeatletter
#+LaTeX_HEADER: \renewenvironment{minted@colorbg}[1]{
#+LaTeX_HEADER: \setlength{\fboxsep}{\z@}
#+LaTeX_HEADER: \def\minted@bgcol{#1}
#+LaTeX_HEADER: \noindent
#+LaTeX_HEADER: \begin{lrbox}{\minted@bgbox}
#+LaTeX_HEADER: \begin{minipage}{\linewidth}}
#+LaTeX_HEADER: {\end{minipage}
#+LaTeX_HEADER: \end{lrbox}%
#+LaTeX_HEADER: \colorbox{\minted@bgcol}{\usebox{\minted@bgbox}}}
#+LaTeX_HEADER: \makeatother
# titlepage with help from : http://www.deesaster.org/blog/index.php?/archives/2299
#+LaTeX_HEADER: \setlength{\droptitle}{-100pt}
#+LaTeX_HEADER: \raggedbottom
*** Output a datastructure to console to put it in the interpreter

In Python you use print and paste the result into the shell:

#+BEGIN_SRC python :results output
print [1, 2, 3]
#+END_SRC

#+RESULTS:
: [1, 2, 3]

#+BEGIN_SRC python :results output
print eval("[1, 2, 3]")
#+END_SRC

#+RESULTS:
: [1, 2, 3]


In Scheme you use write and paste the result into a =(quote ...)= form:

#+BEGIN_SRC scheme :results output
(write '(1 2 3))
(newline)
#+END_SRC

#+RESULTS:
: (1 2 3)

#+BEGIN_SRC scheme :results output 
(write (with-input-from-string "(1 2 3)" read))
#+END_SRC

#+RESULTS:
: (1 2 3)

Both versions have corner cases, but work well for many situations. For custom classes Python requires defining a =__repr__= or =__str__= function which returns a string that can be =eval()='ed to the same class.

*** help in interpreter

In Python you call =help(...)=

#+BEGIN_SRC python :results output
help(help)
#+END_SRC

#+RESULTS:
#+begin_example
Help on _Helper in module site object:

class _Helper(__builtin__.object)
 |  Define the builtin 'help'.
 |  This is a wrapper around pydoc.help (with a twist).
 |  
 |  Methods defined here:
 |  
 |  __call__(self, *args, **kwds)
 |  
 |  __repr__(self)
 |  
 |  ----------------------------------------------------------------------
 |  Data descriptors defined here:
 |  
 |  __dict__
 |      dictionary for instance variables (if defined)
 |  
 |  __weakref__
 |      list of weak references to the object (if defined)

#+end_example

In Guile Scheme you also call =(help ...)=

#+BEGIN_SRC scheme :results output
(help help)
#+END_SRC


Note: =(help help)= does not work within org-mode.

# TODO: Python decorator example

*** Profiling

In Python you can use =python -m profile -s cumtime path/to/file.py= or timeit:

#+BEGIN_SRC python :results output
import timeit
print timeit.timeit("1 + 1", number=1000000)
#+END_SRC

#+RESULTS:
: 0.104151010513

In Guile Scheme you can use ,profile in the interpreter. For fast calls you need to use a loop. Alternatively you can use the statprof module:

#+BEGIN_SRC wisp
use-modules : statprof
with-statprof #:loop 1000000
    + 1 1
#+END_SRC

#+RESULTS:
: 0.879625397

